; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v5)
		(pred_1 ?v2)
		(pred_4 ?v1)
		(pred_3 ?v1)
		(pred_6 ?v2 ?v1)
		(pred_2)
		(pred_5 ?v2))

   (:action op_1
       :parameters  (?v4 ?v6)
       :precondition (and (not-eq ?v4 ?v6) 
                          (pred_4 ?v4) (pred_4 ?v6) (pred_3 ?v4))
       :effect (and  (pred_3 ?v6)
		     (not (pred_3 ?v4))))


   (:action op_2
       :parameters (?v3 ?v8)
       :precondition  (and  (pred_1 ?v3) (pred_4 ?v8)
			    (pred_6 ?v3 ?v8) (pred_3 ?v8) (pred_2))
       :effect (and (pred_5 ?v3)
		    (not (pred_6 ?v3 ?v8)) 
		    (not (pred_2))))

   (:action op_3
       :parameters  (?v3  ?v8)
       :precondition  (and  (pred_1 ?v3) (pred_4 ?v8)
			    (pred_5 ?v3) (pred_3 ?v8))
       :effect (and (pred_6 ?v3 ?v8)
		    (pred_2)
		    (not (pred_5 ?v3)))))

; problem
(define (problem ferry-l5-c3)
(:domain ferry)
(:objects obj_07 obj_03 obj_05 obj_04 obj_02 
          obj_08 obj_01 obj_06 
)
(:init
(pred_4 obj_07)
(pred_4 obj_03)
(pred_4 obj_05)
(pred_4 obj_04)
(pred_4 obj_02)
(pred_1 obj_08)
(pred_1 obj_01)
(pred_1 obj_06)
(not-eq obj_07 obj_03)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(pred_2)
(pred_6 obj_08 obj_03)
(pred_6 obj_01 obj_07)
(pred_6 obj_06 obj_02)
(pred_3 obj_02)
)
(:goal
(and
(pred_6 obj_08 obj_04)
(pred_6 obj_01 obj_07)
(pred_6 obj_06 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_08 obj_04) (pred_3 obj_07))
    (sometime-before  (pred_6 obj_06 obj_04) (pred_3 obj_07))
  )
)
)

; plan
1. (op_2 obj_06 obj_02)
   deleted: (pred_6 obj_06 obj_02) (pred_2)
   added: (pred_5 obj_06)
   goals met: 1 of 3
2. (op_1 obj_02 obj_04)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_04)
   goals met: 1 of 3
3. (op_1 obj_04 obj_03)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_03)
   goals met: 1 of 3
4. (op_3 obj_06 obj_03)
   deleted: (pred_5 obj_06)
   added: (pred_6 obj_06 obj_03) (pred_2)
   goals met: 1 of 3
5. (op_2 obj_08 obj_03)
   deleted: (pred_6 obj_08 obj_03) (pred_2)
   added: (pred_5 obj_08)
   goals met: 1 of 3
6. (op_1 obj_03 obj_07)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_07)
   goals met: 1 of 3
7. (op_3 obj_08 obj_07)
   deleted: (pred_5 obj_08)
   added: (pred_6 obj_08 obj_07) (pred_2)
   goals met: 1 of 3
8. (op_1 obj_07 obj_03)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_03)
   goals met: 1 of 3
9. (op_2 obj_06 obj_03)
   deleted: (pred_6 obj_06 obj_03) (pred_2)
   added: (pred_5 obj_06)
   goals met: 1 of 3
10. (op_1 obj_03 obj_04)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_04)
   goals met: 1 of 3
11. (op_3 obj_06 obj_04)
   deleted: (pred_5 obj_06)
   added: (pred_6 obj_06 obj_04) (pred_2)
   goals met: 2 of 3
12. (op_1 obj_04 obj_07)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_07)
   goals met: 2 of 3
13. (op_2 obj_08 obj_07)
   deleted: (pred_6 obj_08 obj_07) (pred_2)
   added: (pred_5 obj_08)
   goals met: 2 of 3
14. (op_1 obj_07 obj_04)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_04)
   goals met: 2 of 3
15. (op_3 obj_08 obj_04)
   deleted: (pred_5 obj_08)
   added: (pred_6 obj_08 obj_04) (pred_2)
   goals met: 3 of 3
